PANDAS

In [ ]:
pip install pandas

In [2]:
import pandas as pd

In [3]:
d={'Name':'Hisham','Age':20,'Address':'CLT'}
d

{'Name': 'Hisham', 'Age': 20, 'Address': 'CLT'}

In [ ]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry",'Ammu'], 
     "Age": [20,21,19,22,21,22],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi','Kannur']}
d

In [4]:
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
a=[1,2,3,4,5]
d=pd.Series(a)
a

In [17]:
df=pd.DataFrame(a)
df

NameError: name 'a' is not defined

In [ ]:
a=[1,2,3,4,5,6]
d=pd.Series(a,index=['a','b','c','d','e','f'])
a

In [ ]:
df=pd.DataFrame(d)
df

In [ ]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry"], 
     "Age": [20,21,19,22,21],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi']}
d

In [ ]:
df=pd.DataFrame(d)
df

In [ ]:
df.info()

In [ ]:
df.describe()

In [5]:
import pandas as pd

In [7]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry"], 
     "Age": [20,21,19,22,21],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi']}
d

{'Name': ['Hisham', 'Abi', 'Arun', 'Nihal', 'Harry'],
 'Age': [20, 21, 19, 22, 21],
 'Address': ['CLT', 'Malappuram', 'Kannur', 'CLT', 'Cochi']}

In [8]:
df=pd.DataFrame(d)
df

     Name  Age     Address
0  Hisham   20         CLT
1     Abi   21  Malappuram
2    Arun   19      Kannur
3   Nihal   22         CLT
4   Harry   21       Cochi

In [8]:
print(df['Name'])

0    Hisham
1       Abi
2      Arun
3     Nihal
4     Harry
Name: Name, dtype: object

In [9]:
print(df['Name'],['Age'])

0    Hisham
1       Abi
2      Arun
3     Nihal
4     Harry
Name: Name, dtype: object ['Age']

In [10]:
print(df[['Name','Age']])

     Name  Age
0  Hisham   20
1     Abi   21
2    Arun   19
3   Nihal   22
4   Harry   21

In [11]:
print(df['Age']>20)

0    False
1     True
2    False
3     True
4     True
Name: Age, dtype: bool

In [12]:
df[df['Age']>20]

    Name  Age     Address
1    Abi   21  Malappuram
3  Nihal   22         CLT
4  Harry   21       Cochi

In [15]:
df['Gender']=['Male','Male','Male','Male','Male']
df

     Name  Age     Address Gender
0  Hisham   20         CLT   Male
1     Abi   21  Malappuram   Male
2    Arun   19      Kannur   Male
3   Nihal   22         CLT   Male
4   Harry   21       Cochi   Male

In [33]:
df.drop(['Age'],axis=1,inplace=True)
df

     Name     Address
0  Hisham         CLT
1     Abi  Malappuram
2    Arun      Kannur
3   Nihal         CLT
4   Harry       Cochi

In [9]:
d={'Name':['Hisham','Hisham','Abi','Nihal','Arun'],
   'Age':[20,20,23,21,21],
   'Adderss':['CLT','CLT','Malappuram','Cochi','Kannur']}
d

{'Name': ['Hisham', 'Hisham', 'Abi', 'Nihal', 'Arun'],
 'Age': [20, 20, 23, 21, 21],
 'Adderss': ['CLT', 'CLT', 'Malappuram', 'Cochi', 'Kannur']}

In [10]:
df=pd.DataFrame(d)
df

     Name  Age     Adderss
0  Hisham   20         CLT
1  Hisham   20         CLT
2     Abi   23  Malappuram
3   Nihal   21       Cochi
4    Arun   21      Kannur

In [11]:
df.drop_duplicates()

     Name  Age     Adderss
0  Hisham   20         CLT
2     Abi   23  Malappuram
3   Nihal   21       Cochi
4    Arun   21      Kannur

In [44]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry","Ammu","Adhil"], 
     "Age": [20,None,19,22,21,None,23],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi',"Alappuzha","Wayanad"]}
d

{'Name': ['Hisham', 'Abi', 'Arun', 'Nihal', 'Harry', 'Ammu', 'Adhil'],
 'Age': [20, None, 19, 22, 21, None, 23],
 'Address': ['CLT',
  'Malappuram',
  'Kannur',
  'CLT',
  'Cochi',
  'Alappuzha',
  'Wayanad']}

In [45]:
df=pd.DataFrame(d)
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [47]:
df.dropna(inplace=True)
df

     Name   Age  Address
0  Hisham  20.0      CLT
2    Arun  19.0   Kannur
3   Nihal  22.0      CLT
4   Harry  21.0    Cochi
6   Adhil  23.0  Wayanad

In [5]:
import pandas pd
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry","Ammu","Adhil"], 
     "Age": [20,None,19,22,21,None,23],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi',"Alappuzha","Wayanad"]}
d

{'Name': ['Hisham', 'Abi', 'Arun', 'Nihal', 'Harry', 'Ammu', 'Adhil'],
 'Age': [20, None, 19, 22, 21, None, 23],
 'Address': ['CLT',
  'Malappuram',
  'Kannur',
  'CLT',
  'Cochi',
  'Alappuzha',
  'Wayanad']}

In [6]:
df=pd.DataFrame(d)
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [8]:
df.fillna(20,inplace=True)
df

NameError: name 'df' is not defined

In [7]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry","Ammu","Adhil"], 
     "Age": [20,None,19,22,21,None,23],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi',"Alappuzha","Wayanad"]}
d

{'Name': ['Hisham', 'Abi', 'Arun', 'Nihal', 'Harry', 'Ammu', 'Adhil'],
 'Age': [20, None, 19, 22, 21, None, 23],
 'Address': ['CLT',
  'Malappuram',
  'Kannur',
  'CLT',
  'Cochi',
  'Alappuzha',
  'Wayanad']}

In [17]:
df=pd.DataFrame(d)
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [21]:
x=df['Age'].mean()

In [22]:
df.fillna(x)

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi  21.0  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu  21.0   Alappuzha
6   Adhil  23.0     Wayanad

In [23]:
d = {"Name": ["Hisham","Abi","Arun","Nihal","Harry","Ammu","Adhil"], 
     "Age": [20,None,19,22,21,None,23],
     "Address": ['CLT','Malappuram','Kannur','CLT','Cochi',"Alappuzha","Wayanad"]}
d

{'Name': ['Hisham', 'Abi', 'Arun', 'Nihal', 'Harry', 'Ammu', 'Adhil'],
 'Age': [20, None, 19, 22, 21, None, 23],
 'Address': ['CLT',
  'Malappuram',
  'Kannur',
  'CLT',
  'Cochi',
  'Alappuzha',
  'Wayanad']}

In [24]:
df=pd.DataFrame(d)
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [25]:
x=df['Age'].median()

In [1]:
df.fillna(x)

NameError: name 'df' is not defined

In [31]:
df.to_csv('data.csv')
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [4]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.4-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.4-py2.py3-none-any.whl (251 kB)
   ---------------------------------------- 0.0/251.4 kB ? eta -:--:--
   ---------------------------------------  245.8/251.4 kB 5.0 MB/s eta 0:00:01
   ---------------------------------------- 251.4/251.4 kB 3.1 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.4
Note: you may need to restart the kernel to use updated packages.

In [12]:
df.to_excel('newdata.xlsx')
df

     Name   Age     Address
0  Hisham  20.0         CLT
1     Abi   NaN  Malappuram
2    Arun  19.0      Kannur
3   Nihal  22.0         CLT
4   Harry  21.0       Cochi
5    Ammu   NaN   Alappuzha
6   Adhil  23.0     Wayanad

In [16]:
x=pd.read_csv('data.csv')
x

   Unnamed: 0    Name   Age     Address
0           0  Hisham  20.0         CLT
1           1     Abi   NaN  Malappuram
2           2    Arun  19.0      Kannur
3           3   Nihal  22.0         CLT
4           4   Harry  21.0       Cochi
5           5    Ammu   NaN   Alappuzha
6           6   Adhil  23.0     Wayanad